# GetProjectFullPath

## Description
Gets the path and filename of the Project File for Project Sharing.

```pascal
FUNCTION GetProjectFullPath(VAR fullPath : STRING) : BOOLEAN;
```

```python

def vs.GetProjectFullPath():
    return (BOOLEAN, fullPath)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|fullPath|STRING||

## Returns
Returns True on success, False on failure or if not Project Sharing

## Version
Availability: from Vectorworks 2016
## Category
* Project Sharing